Tekla Open API Reference for Tekla Structures 2025
PointCloud.GetPointClouds Method
 Utility function: Gets available point clouds.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static List<PointCloud> GetPointClouds()
Public Shared Function GetPointClouds As List(Of PointCloud)
Return Value
Type: List<PointCloud>
The available point clouds.
See Also
Reference
PointCloud Class
Tekla.Structures.Model Namespace